src/cf/Catalogs/инт_ПотокиДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>инт_ПотокиДанных</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаправлениеПотока</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_НаправлениеПотокаДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОбработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопытокОбработки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаузаМеждуПопыткамиОбработки</Name>
					<Comment>Пауза между попытками обработки в секундах.(0 - сообщение будет обработано повторно как можно быстрее)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалятьОбработанныеСообщенияЧерез</Name>
					<Comment>Количество дней, через которое обработанные сообщения будут удалены(0 - сообщения не удаляются)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валидация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пример</Name>
					<Comment>Сериализованное представление примера исходных данных (ЗначениеВСтрокуВнутр)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АсинхроннаяОбработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_Схемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСхемыПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкомпилированныйОбработчик</Name>
					<Comment>Скомпилированная внешняя обработка (EPF) из текста обработчика</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСкомпилированногоОбработчика</Name>
					<Comment>Признак версии: хеш текста, из которого получен СкомпилированныйОбработчик</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтслеживаемыеРеквизиты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПодписчикиПотока</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подписчик</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.инт_Подписчик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПодпискиНаВходящиеСообщения</Name>
					<Comment>Источники входящих сообщений (Kafka/RabbitMQ консьюмеры)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подписка</Name>
							<Comment>Подписчик Kafka или RabbitMQ</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.инт_Подписка</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/инт_ВерсииОбработчиковПовтИсп/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// инт_ВерсииОбработчиковПовтИсп
//
// Признак версии обработчика, сохранённого в базе данных.
// Повторное использование возвращаемых значений: В течение вызова.
//
// Признак версии служит ключом кэша подключённых обработок (инт_ГенераторОбработокПовтИсп),
// поэтому новый текст обработчика применяется со следующего серверного вызова.
// Компиляция и подключение внешней обработки здесь не выполняются: иначе они
// повторялись бы на каждый серверный вызов.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Функция - Версия обработчика потока
// Возвращает признак версии скомпилированного обработчика потока данных:
// хеш текста, из которого получен сохранённый в базе данных EPF.
//
// Параметры:
//  ПотокДанных - СправочникСсылка.инт_ПотокиДанных - Ссылка на поток данных.
//
// Возвращаемое значение:
//  Строка - Признак версии. Пустая строка, если обработчик ни разу не компилировался.
//
Функция ВерсияОбработчикаПотока(Знач ПотокДанных) Экспорт
	
	// Запросом, а не обращением через точку: обращение через точку прочитало бы объект целиком
	// вместе с реквизитом СкомпилированныйОбработчик, то есть двоичные данные EPF на каждый
	// серверный вызов. Запрос собран здесь, а не взят из инт_ОбщегоНазначения: тот модуль
	// объявлен только для сервера, а этот вызывается ещё из внешнего соединения
	// и толстого клиента обычного приложения.
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПотокиДанных.ХешСкомпилированногоОбработчика КАК ХешСкомпилированногоОбработчика
		|ИЗ
		|	Справочник.инт_ПотокиДанных КАК ПотокиДанных
		|ГДЕ
		|	ПотокиДанных.Ссылка = &ПотокДанных";
	Запрос.УстановитьПараметр("ПотокДанных", ПотокДанных);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.ХешСкомпилированногоОбработчика, "");
	
КонецФункции

// Функция - Строка пост-обработки
// Возвращает номер строки и текст обработчика пост-обработки подписчика для кода состояния.
//
// Читается запросом, а не обращением через точку: обращение через точку прочитало бы
// табличную часть целиком вместе с реквизитом СкомпилированныйОбработчик, то есть двоичные
// данные всех обработчиков подписчика на каждое сообщение.
//
// Параметры:
//  Подписчик    - СправочникСсылка - Подписчик с табличной частью ПостПроцессинг.
//  КодСостояния - Число - Код состояния ответа.
//
// Возвращаемое значение:
//  Структура:
//    * НомерСтроки      - Число - Номер строки табличной части. Ноль, если строки нет.
//    * ТекстОбработчика - Строка - Текст обработчика. Пустая строка, если строки нет.
//
Функция СтрокаПостОбработки(Знач Подписчик, Знач КодСостояния) Экспорт
	
	ИмяТаблицы = Подписчик.Метаданные().ПолноеИмя();
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрШаблон(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПостПроцессинг.НомерСтроки КАК НомерСтроки,
		|	ПостПроцессинг.Обработчик КАК ТекстОбработчика
		|ИЗ
		|	%1.ПостПроцессинг КАК ПостПроцессинг
		|ГДЕ
		|	ПостПроцессинг.Ссылка = &Подписчик
		|	И ПостПроцессинг.КодСостояния = &КодСостояния", ИмяТаблицы);
	Запрос.УстановитьПараметр("Подписчик", Подписчик);
	Запрос.УстановитьПараметр("КодСостояния", КодСостояния);
	
	Строка = Новый Структура("НомерСтроки, ТекстОбработчика", 0, "");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Строка, Выборка);
	КонецЕсли;
	
	Возврат Строка;
	
КонецФункции

#КонецОбласти
